---
kind: method
id: M:Autodesk.Revit.DB.ColorFillScheme.GetSupportedParameterIds
source: html/d19ac539-c56d-1c3c-1b7b-8801e9713c06.htm
---
# Autodesk.Revit.DB.ColorFillScheme.GetSupportedParameterIds Method

Retrieves collection of all parameters supported by the scheme.

## Syntax (C#)
```csharp
public IList<ElementId> GetSupportedParameterIds()
```

## Remarks
Supported parameters depends on CategoryId property.